In [2]:
import pandas as pd
import numpy as np

In [3]:
root = '/home/sihartist/Desktop/'

In order to display all columns

In [4]:
pd.set_option('display.max_columns', None)

In [5]:
df = pd.read_excel(root + 'fraud-detection/dataset/final.xlsx', dtype=str)

## Info

In [6]:
df.head(2)

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,V11,V12,V13,V14,V15,V16,V17,V18,V19,V20,V21,V22,V23,V24,V25,V26,V27,CLASS
0,31,281,22,010112,500,01/05/2009,01/05/2011,02/07/2009 21:21:42,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,071181,0,01000002,01000002,26/12/2009,NaN,952,384,VERSUS BANK 2 PLATEAUX REGION LAGUNECI,0
1,31,281,22,010112,500,01/06/2009,01/06/2011,26/06/2009 11:16:47,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,004737,0,01000001,01000001,26/12/2009,NaN,952,384,VERSUS BANK PLATEAU REGION LAGUNECI,0

In [69]:
attr = pd.read_excel(root + 'fraud-detection/dataset/attributes.xlsx', dtype=str)

In [70]:
attr

         PROCESSING_CODE                CHAR(2 BYTE)   V1
0        FUNCTION_CODE                  CHAR(3 BYTE)   V2
1        NETWORK_CODE                   CHAR(2 BYTE)   V3
2        ISSUING_BANK                   CHAR(6 BYTE)   V4
3        SERVICE_CODE                   CHAR(3 BYTE)   V5
4                START_EXPIRY_DATE              DATE   V6
5                END_EXPIRY_DATE                DATE   V7
6                TRANSMISSION_DATE_AND_TIME     DATE   V8
7        TRANSACTION_AMOUNT             NUMBER(18,3)   V9
8        BILLING_AMOUNT                 NUMBER(18,3)  V10
9        TRANSACTION_FEE                NUMBER(18,3)  V11
10  ACQUIRER_INSTITUTION_CODE      VARCHAR2(11 CHAR)  V12
11       CARD_ACCEPTOR_ACTIVITY         CHAR(4 BYTE)  V13
12       ISS_SETTLEMENT_FEE             NUMBER(18,3)  V14
13   POS_ENTRY_MODE                 VARCHAR2(4 CHAR)  V15
14      POS_DATA                       CHAR(12 BYTE)  V16
15       FORWARDING_BANK                CHAR(6 BYTE)  V17
16        AUTHORIZATION_LENGTH           NUMBER(1,0)  V18
17       AUTHORIZATION_CODE             CHAR(6 BYTE)  V19
18       ORIGINE_CODE                   CHAR(1 BYTE)  V20
19  CARD_ACCEPTOR_TERM_ID          VARCHAR2(15 CHAR)  V21
20  CARD_ACCEPTOR_ID               VARCHAR2(15 CHAR)  V22
21               ISS_SETTLEMENT_DATE            DATE  V23
22       ISS_SETTLEMENT_AMOUNT          NUMBER(18,3)  V24
23       TRANSACTION_CURRENCY           CHAR(3 BYTE)  V25
24       ACQUIRING_COUNTRY_CODE         CHAR(3 BYTE)  V26
25  CARD_ACC_NAME_ADDRESS          VARCHAR2(40 CHAR)  V27

In [5]:
df.head(2)

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,V11,V12,V13,V14,V15,V16,V17,V18,V19,V20,V21,V22,V23,V24,V25,V26,V27,CLASS
0,31,281,22,010112,500,01/05/2009,01/05/2011,02/07/2009 21:21:42,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,071181,0,01000002,01000002,26/12/2009,NaN,952,384,VERSUS BANK 2 PLATEAUX REGION LAGUNECI,0
1,31,281,22,010112,500,01/06/2009,01/06/2011,26/06/2009 11:16:47,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,004737,0,01000001,01000001,26/12/2009,NaN,952,384,VERSUS BANK PLATEAU REGION LAGUNECI,0

In [6]:
df.tail(2)

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,V11,V12,V13,V14,V15,V16,V17,V18,V19,V20,V21,V22,V23,V24,V25,V26,V27,CLASS
140652,20,281,22,000010,500,01/01/2009,01/01/2012,02/10/2010 10:30:04,NaN,676845.8400652999,NaN,010112,7693,NaN,NaN,21140121124C,NaN,6,016736,0,01000003,01000003,26/12/2010,NaN,952,384,VERSUS BANK ZONE 4 REGION LAGUNECI,1
140653,31,281,22,000010,500,01/07/2009,01/07/2011,27/09/2010 14:53:19,NaN,730340.728757999,NaN,010112,6011,NaN,NaN,21140161124C,NaN,6,036370,0,01000001,01000001,26/12/2010,NaN,952,384,VERSUS BANK PLATEAU REGION LAGUNECI,1

In [7]:
df.info(verbose=True, show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140654 entries, 0 to 140653
Data columns (total 28 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   V1      140654 non-null  object
 1   V2      140654 non-null  object
 2   V3      139679 non-null  object
 3   V4      140654 non-null  object
 4   V5      140654 non-null  object
 5   V6      124864 non-null  object
 6   V7      140654 non-null  object
 7   V8      140654 non-null  object
 8   V9      28907 non-null   object
 9   V10     55385 non-null   object
 10  V11     0 non-null       object
 11  V12     140654 non-null  object
 12  V13     140654 non-null  object
 13  V14     0 non-null       object
 14  V15     10548 non-null   object
 15  V16     140654 non-null  object
 16  V17     0 non-null       object
 17  V18     140616 non-null  object
 18  V19     110978 non-null  object
 19  V20     139679 non-null  object
 20  V21     140654 non-null  object
 21  V22     140654 non-null  object
 22  V23     140654 non-null  object
 23  V24     27868 non-null   object
 24  V25     140654 non-null  object
 25  V26     140654 non-null  object
 26  V27     140654 non-null  object
 27  CLASS   140654 non-null  object
dtypes: object(28)
memory usage: 30.0+ MB

Dataset is balanced:

In [66]:
df.loc[df.CLASS=='0'].V1.value_counts()

31    67500
01     2813
00       14
Name: V1, dtype: int64

V1    PROCESSING_CODE    
V2    FUNCTION_CODE    
V3    NETWORK_CODE    
V4    ISSUING_BANK    
V5    SERVICE_CODE    
V6    START_EXPIRY_DATE    
V7    END_EXPIRY_DATE    
V8    TRANSMISSION_DATE_AND_TIME    
V9    TRANSACTION_AMOUNT    
V10    BILLING_AMOUNT    
V11    TRANSACTION_FEE    
V12    ACQUIRER_INSTITUTION_CODE    
V13    CARD_ACCEPTOR_ACTIVITY
V14    SETTLEMENT_FEE    
V15    POS_ENTRY_MODE
V16    POS_DATA
V17    FORWARDING_BANK    
V18    AUTHORIZATION_LENGTH    
V19    AUTHORIZATION_CODE
V20    ORIGINE_CODE    
V21    CARD_ACCEPTOR_TERMINAL_ID    
V22    CARD_ACCEPTOR_ID    
V23    SETTLEMENT_DATE    
V24    SETTLEMENT_AMOUNT    
V25    TRANSACTION_CURRENCY     
V26    ACQUIRING_COUNTRY_CODE      
V27    CARD_ACC_NAME_ADDRESS    
CLASS

Where V1 == 31, put V10 = 0. For non fraud data.

In [56]:
df.V1.value_counts()

31    89627
01    28100
00    10572
20    10550
17     1726
40       79
Name: V1, dtype: int64

In [13]:
df.CLASS.value_counts()

0    70327
1    70327
Name: CLASS, dtype: int64

## Test 1

For now, let's keep only the columns on which we applied the fraud rules.

V2: 300 - 301 (fraude) , 201 (non fraude)   
V3: visa: 001, Mastercard: 002 (both cases) 
V5: remove  
V6: check duration in other instances
V9: same as billing amount (V10)    
V11: remove     
V14: remove     
V15: duplicate with non fraud values    
V17: remove     
V18: duplicate or remove if not possible
V19: random 6 numbers   
V20: (what is it ?) remove      
V24: same as billing amount     

V12 is Acquirer code ( Aq institution code)

In [1]:
new_df = df.loc[ : ,['V1', 'V4', 'V10', 'V12', 'V13', 'V16', 'V15', 'V21', 'V26', 'CLASS']]

KeyboardInterrupt

In [11]:
new_df.tail(2)

,V1,V4,V10,V12,V13,V16,V15,V21,V26,CLASS
140652,20,000010,676845.8400652999,010112,7693,21140121124C,NaN,01000003,384,1
140653,31,000010,730340.728757999,010112,6011,21140161124C,NaN,01000001,384,1

V10 is the transaction amount. We can cast it into float.

In [16]:
new_df['V10'] = new_df['V10'].astype(float)
new_df['CLASS'] = new_df['CLASS'].astype(int)

In [17]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140654 entries, 0 to 140653
Data columns (total 10 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   V1      140654 non-null  object
 1   V4      140654 non-null  object
 2   V10     55385 non-null   float64
 3   V12     140654 non-null  object
 4   V13     140654 non-null  object
 5   V16     140654 non-null  object
 6   V15     10548 non-null   object
 7   V21     140654 non-null  object
 8   V26     140654 non-null  object
 9   CLASS   140654 non-null  int64
dtypes: float64(1), int64(1), object(8)
memory usage: 10.7+ MB

We can see that the columns V10 and V15 have many null values. 
Let's separate the fraud data from the non fraud data to analyse them separately.

In [19]:
n_fraud = new_df.loc[new_df['CLASS']==0]
fraud = new_df.loc[new_df['CLASS']==1]

In [20]:
n_fraud.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70327 entries, 0 to 70326
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V1      70327 non-null  object
 1   V4      70327 non-null  object
 2   V10     2827 non-null   float64
 3   V12     70327 non-null  object
 4   V13     70327 non-null  object
 5   V16     70327 non-null  object
 6   V15     0 non-null      object
 7   V21     70327 non-null  object
 8   V26     70327 non-null  object
 9   CLASS   70327 non-null  int64
dtypes: float64(1), int64(1), object(8)
memory usage: 5.9+ MB

All the values for V15 in the non fraud data are null, while 96% of V10 are null ...

In [21]:
fraud.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70327 entries, 70327 to 140653
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V1      70327 non-null  object
 1   V4      70327 non-null  object
 2   V10     52558 non-null  float64
 3   V12     70327 non-null  object
 4   V13     70327 non-null  object
 5   V16     70327 non-null  object
 6   V15     10548 non-null  object
 7   V21     70327 non-null  object
 8   V26     70327 non-null  object
 9   CLASS   70327 non-null  int64
dtypes: float64(1), int64(1), object(8)
memory usage: 5.9+ MB

86% of V15 are null, and 25% of V10 are null.

One way to treat this would be to use the fraud rules and extract from them non-fraud values to fill the null values.

For the non fraud data, this means that we need to fill the attribute with a value that ensures that the new instance doesn't match any of the fraud rules.

**We have 12 rules that include V10:**

***Rule 1:***

```
V4 = ''000010''
V10 BETWEEN 90 AND 200
(V16,7,1)   IN  (''A'',''M'')
```

***Rule 2:***

```
V4 = ''000010'' 
V13  IN (''5921'') 
V10 > 5000
```

***Rule 3:***

```
V4 = ''000010'' 
V13  IN (''5921'') 
V21  IN (''549038'')
V10 >= 2000
```

***Rule 4:***

```
V4 = ''000010'' 
V1 IN (''20'') 
V13  NOT IN (''5311'',''7011'') 
V10 >= 100000
```

***Rule 5:***

```
V4 = ''000010''
V1 IN (''20'')
V13  NOT IN (''5331'',''7011'')
V10 >= 25000
```

***Rule 6:***

```
V4 = ''000010''  
V10 >= 8000  
SUBSTR(:X(1).V16,7,1)   NOT IN  (''5'')
```

***Rule 7:***

```
V4 = ''000010''
V1 IN (''00'')
V10 >= 60000
SUBSTR(:X(1).V16,7,1) IN (''9'',''S'',''T'',''U'',''V'')
```

***Rule 8:***

```
V4 = ''000010''
V10 >= 18000
(V16,7,1)  IN  (''5'')
```

***Rule 9:***

```
V4 = ''000010'' 
V1 IN (''20'') 
V13  NOT IN (''5331'',''7011'') 
V10 >= 10000
```

***Rule 10:***

```
V4 = ''000010''
V1 IN (''00'')
V10 BETWEEN 999.99  AND 7999.99 )
V16 LIKE ''5___________''
(V16,7,1)   IN  (''2'',''8'')
```

***Rule 11:***

```
V4 = ''000010''
V1 IN (''00'')
V13  NOT IN (''7995'')
V10 >= 60000
(V16,7,1)   IN  (''5'')
```

***Rule 12:***

```
V4 = ''000010''
V1 IN (''01'')
V10 < 100
```

In [35]:
v10_nfraud = n_fraud.loc[n_fraud['V10'].isnull()]

In [36]:
v10_nfraud.V1.value_counts()

31    67500
Name: V1, dtype: int64

In [37]:
v10_nfraud.V4.value_counts()

010112    65671
101010     1829
Name: V4, dtype: int64

We can see that all values for V4 and V1 do not match the conditions in the fraud rules. So, we can give V10 any value we want as it wont match any fraud rule.

In [38]:
v10_nfraud.head()

   V1      V4  V10     V12   V13           V16  V15       V21  V26  CLASS
0  31  010112  NaN  010112  6011  21140121124C  NaN  01000002  384      0
1  31  010112  NaN  010112  6011  21140121124C  NaN  01000001  384      0
2  31  010112  NaN  010112  6011  21140121124C  NaN  01000002  384      0
3  31  010112  NaN  010112  6011  21140121124C  NaN  01000002  384      0
4  31  010112  NaN  010112  6011  21140121124C  NaN  01000001  384      0

In [67]:
def fill_v10(df):
    cp_df = pd.DataFrame.copy(df)
    for i in range(len(cp_df)):
        cp_df.at[i, 'V10'] = np.random.uniform(new_df['V10'].min(), 5000)
    return cp_df

filling NAN values of V10

In [41]:
v10_nfraud = fill_v10(v10_nfraud)

In [49]:
v10_nfraud.V10.max()

799948.5650156407

Concatenate with the non NAN values of V10

In [55]:
v10_non_null = n_fraud.dropna(axis=0, subset=['V10'])

new_n_fraud = pd.concat([v10_non_null, v10_nfraud])
new_n_fraud.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 72423 entries, 448 to 67493
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   V1      70327 non-null  object
 1   V4      70327 non-null  object
 2   V10     70327 non-null  float64
 3   V12     70327 non-null  object
 4   V13     70327 non-null  object
 5   V16     70327 non-null  object
 6   V15     0 non-null      object
 7   V21     70327 non-null  object
 8   V26     70327 non-null  object
 9   CLASS   70327 non-null  float64
dtypes: float64(2), object(8)
memory usage: 6.1+ MB

Now we need to treat V15.

**We have three rules that include V15:**

***Rule 1:***

```
V4 = ''000010''
V1 IN (''01'',''17'')
V26 IN (''360'')
V15 IN (''902'')
```

***Rule 2:***

```
V4 = ''000010''
V1 IN (''01'')
V26 IN (''360'',''508'')
V15 IN (''90'')
```

***Rule 3:***

```
V4 = ''000010'' 
V26 NOT IN (''072'',''426'',''508'',''516'') 
V12  NOT IN (''001264'') 
V15 IN (''90'')
```

In [ ]:
def fill_v15(df):
    new_df = pd.DataFrame.copy(df)
    for i in range(len(new_df)):
        new_df

## Test 2

In [84]:
df.head(2)

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,V11,V12,V13,V14,V15,V16,V17,V18,V19,V20,V21,V22,V23,V24,V25,V26,V27,CLASS
0,31,281,22,010112,500,01/05/2009,01/05/2011,02/07/2009 21:21:42,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,071181,0,01000002,01000002,26/12/2009,NaN,952,384,VERSUS BANK 2 PLATEAUX REGION LAGUNECI,0
1,31,281,22,010112,500,01/06/2009,01/06/2011,26/06/2009 11:16:47,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,004737,0,01000001,01000001,26/12/2009,NaN,952,384,VERSUS BANK PLATEAU REGION LAGUNECI,0

In [ ]:
df['V6'] = pd.to_datetime(df['V6'])
df['V7'] = pd.to_datetime(df['V7'])
df['V23'] = pd.to_datetime(df['V23'])

In [88]:
df.head(2)

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,V11,V12,V13,V14,V15,V16,V17,V18,V19,V20,V21,V22,V23,V24,V25,V26,V27,CLASS
0,31,281,22,010112,500,2009-01-05,2011-01-05,02/07/2009 21:21:42,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,071181,0,01000002,01000002,2009-12-26,NaN,952,384,VERSUS BANK 2 PLATEAUX REGION LAGUNECI,0
1,31,281,22,010112,500,2009-01-06,2011-01-06,26/06/2009 11:16:47,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,004737,0,01000001,01000001,2009-12-26,NaN,952,384,VERSUS BANK PLATEAU REGION LAGUNECI,0

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140654 entries, 0 to 140653
Data columns (total 28 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   V1      140654 non-null  object
 1   V2      140654 non-null  object
 2   V3      139679 non-null  object
 3   V4      140654 non-null  object
 4   V5      140654 non-null  object
 5   V6      124864 non-null  datetime64[ns]
 6   V7      140654 non-null  datetime64[ns]
 7   V8      140654 non-null  object
 8   V9      28907 non-null   object
 9   V10     55385 non-null   object
 10  V11     0 non-null       object
 11  V12     140654 non-null  object
 12  V13     140654 non-null  object
 13  V14     0 non-null       object
 14  V15     10548 non-null   object
 15  V16     140654 non-null  object
 16  V17     0 non-null       object
 17  V18     140616 non-null  object
 18  V19     110978 non-null  object
 19  V20     139679 non-null  object
 20  V21     140654 non-null  object
 21  V22     140654 non-null  object
 22  V23     140654 non-null  datetime64[ns]
 23  V24     27868 non-null   object
 24  V25     140654 non-null  object
 25  V26     140654 non-null  object
 26  V27     140654 non-null  object
 27  CLASS   140654 non-null  object
dtypes: datetime64[ns](3), object(25)
memory usage: 30.0+ MB

In [95]:
df['year V6'] = df['V6'].dt.year
df.head(2)

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,V11,V12,V13,V14,V15,V16,V17,V18,V19,V20,V21,V22,V23,V24,V25,V26,V27,CLASS,year V6
0,31,281,22,010112,500,2009-01-05,2011-01-05,02/07/2009 21:21:42,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,071181,0,01000002,01000002,2009-12-26,NaN,952,384,VERSUS BANK 2 PLATEAUX REGION LAGUNECI,0,2009.0
1,31,281,22,010112,500,2009-01-06,2011-01-06,26/06/2009 11:16:47,NaN,NaN,NaN,010112,6011,NaN,NaN,21140121124C,NaN,6,004737,0,01000001,01000001,2009-12-26,NaN,952,384,VERSUS BANK PLATEAU REGION LAGUNECI,0,2009.0